/*--------------------------------------------------------------------
/* File name   : LED.h
/* Author      : PSYM
/* Copyright(C): 2023 PSYM. All rights reserved.
/*--------------------------------------------------------------------
 */
#ifndef __LED_H_
#define __LED_H_

/* 包含头文件 -------------------------------------------------------*/
#include "STC8Ax_REG.h"
#include "STC8Ax_DELAY.h"
#include <intrins.h>
 
/* 类型定义 ---------------------------------------------------------*/
/* None. */

/* 宏定义 -----------------------------------------------------------*/
/* None. */

/* 扩展变量 ---------------------------------------------------------*/
extern int IMAGES_LEN;
extern int IMAGES1_LEN;

/* 函数声明 ---------------------------------------------------------*/
void LED(uint8 column);
void LED1(uint8 column);

#endif /* __LED_H_ */

/*>>>>>>>>>> (C) COPYRIGHT PSYM <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/
